project/app/views/patientinfos/_form.html.erb

    <%#= form.text_field :nurseID %>
    <%= form.select :nurseID, options_for_select(Nurse.all.map{|s|[s.nurseName, s.nurseID]}) %>
---
SELECT `nurses`.* FROM `nurses`