project/app/views/patientinfos/index.html.erb

SELECT  `nurses`.* FROM `nurses` WHERE `nurses`.`nurseID` = 123 LIMIT 1
---
        <td><%= patientinfo.dateUpdated %></td>
        <td><%= Nurse.find(patientinfo.nurseID).nurseName %></td>