project/app/views/patientinfos/show.html.erb

    <strong>Nurse responsible:</strong>
    <%= Nurse.find(@patientinfo.nurseID).nurseName %>
---
SELECT  `nurses`.* FROM `nurses` WHERE `nurses`.`nurseID` = 123 LIMIT 1

    <% Patienthistory.where(@patientinfo.patientID==params[:id]).each do |patient| %>
      <% Medicalhistory.where(medHisID:patient.medHisID).each do |history| %>
---
SELECT `medicalhistories`.* FROM `medicalhistories` WHERE `medicalhistories`.`medHisID` = 12345