project/app/views/patientinfos/show.html.erb

SELECT  `currentmedicals`.* FROM `currentmedicals` WHERE `currentmedicals`.`currMedID` = 1 LIMIT 1
---
      <strong>Height:</strong>
      <%= Currentmedical.find(@patientinfo.currMedID).height %>

SELECT  `currentmedicals`.* FROM `currentmedicals` WHERE `currentmedicals`.`currMedID` = 1 LIMIT 1
---
      <strong>Allergies:</strong>
      <%= Currentmedical.find(@patientinfo.currMedID).allergies %>

SELECT  `currentmedicals`.* FROM `currentmedicals` WHERE `currentmedicals`.`currMedID` = 1 LIMIT 1  [["currMedID", 1], ["LIMIT", 1]]
---
      <strong>Blood Pressure</strong>
      <%= Currentmedical.find(@patientinfo.currMedID).bloodPressure %>

SELECT  `currentmedicals`.* FROM `currentmedicals` WHERE `currentmedicals`.`currMedID` = 1 LIMIT 1  [["currMedID", 1], ["LIMIT", 1]]
---
      <strong>Symptoms</strong>
      <%= Currentmedical.find(@patientinfo.currMedID).symptoms %>

SELECT  `currentmedicals`.* FROM `currentmedicals` WHERE `currentmedicals`.`currMedID` = 1 LIMIT 1  [["currMedID", 1], ["LIMIT", 1]]
---
    <strong>Medications</strong>
    <%= Currentmedical.find(@patientinfo.currMedID).medications %>

SELECT  `currentmedicals`.* FROM `currentmedicals` WHERE `currentmedicals`.`currMedID` = 1 LIMIT 1  [["currMedID", 1], ["LIMIT", 1]]
---
    <strong>Date Created</strong>
    <%= Currentmedical.find(@patientinfo.currMedID).dateCreated %>

SELECT  `currentmedicals`.* FROM `currentmedicals` WHERE `currentmedicals`.`currMedID` = 1 LIMIT 1  [["currMedID", 1], ["LIMIT", 1]]
---
    <strong>Date Updated</strong>
    <%= Currentmedical.find(@patientinfo.currMedID).dateUpdated %>

SELECT  `currentmedicals`.* FROM `currentmedicals` WHERE `currentmedicals`.`currMedID` = 1 LIMIT 1  [["currMedID", 1], ["LIMIT", 1]]
---
    <strong>Height:</strong>
    <%= Currentmedical.find(@patientinfo.currMedID).height %>

SELECT `patienthistories`.* FROM `patienthistories` WHERE (123)
---
  <%# end %>
  <% Patienthistories.find(@patientinfo.patientID)%>