project/app/controllers/analyzeordiagnoses_controller.rb

SELECT `analyzeordiagnoses`.* FROM `analyzeordiagnoses`
---
  def index
    @analyzeordiagnoses = Analyzeordiagnose.all