project/app/controllers/currentmedicals_controller.rb

  def index
    @currentmedicals = Currentmedical.all
---
SELECT `currentmedicals`.* FROM `currentmedicals`

  def create
    @currentmedical = Currentmedical.new(currentmedical_params)

    respond_to do |format|
      if @currentmedical.save
---
INSERT INTO `currentmedicals` (`dateCreated`, `dateUpdated`, `medications`, `allergies`, `symptoms`, `bloodPressure`, `height`, `weight`) VALUES ('2018-12-03 10:13:00', '2018-12-03 10:13:00', 'alskdjalsdjla', 'aljsdlkajsdajsk', 'asdasdsa', 'asdkjalksdjas', 12, 123.0)