project/app/controllers/doctors_controller.rb

  def index
    @doctors = Doctor.all
---
SELECT `doctors`.* FROM `doctors`

  def create
    @doctor = Doctor.new(doctor_params)

    respond_to do |format|
      if @doctor.save
---
INSERT INTO `doctors` (`docName`, `specialization`, `department`, `fee`, `schedule`) VALUES ('Mario', 'Jumping', 'Mushroom Kingdom', 53.0, 'MWF')

  def destroy
    @doctor.destroy
---
DELETE FROM `doctors` WHERE `doctors`.`doctorID` = 10000

    def set_doctor
      @doctor = Doctor.find(params[:id])
---
SELECT  `doctors`.* FROM `doctors` WHERE `doctors`.`doctorID` = 10000 LIMIT 1