project/app/controllers/labtestsresults_controller.rb

SELECT `labtestsresults`.* FROM `labtestsresults`
---
  def index
    @labtestsresults = Labtestsresult.all

INSERT INTO `labtestsresults` (`testID`, `dateAndTime`, `testName`, `testResults`) VALUES (2, '2018-12-02 17:12:00', 'henlo', 'B positive')
---
  def create
    @labtestsresult = Labtestsresult.new(labtestsresult_params)

    respond_to do |format|
      if @labtestsresult.save

SELECT  `labtestsresults`.* FROM `labtestsresults` WHERE `labtestsresults`.`testID` = 2 LIMIT 1
---
    def set_labtestsresult
      @labtestsresult = Labtestsresult.find(params[:id])