project/app/controllers/medicalhistories_controller.rb

SELECT `medicalhistories`.* FROM `medicalhistories`
---
  def index
    @medicalhistories = Medicalhistory.all