project/app/controllers/nurses_controller.rb

SELECT `nurses`.* FROM `nurses`
---
  def index
    @nurses = Nurse.all

INSERT INTO `nurses` (`nurseName`, `department`) VALUES ('Burger', 'Krusty Krabs')
---
  def create
    @nurse = Nurse.new(nurse_params)

    respond_to do |format|
      if @nurse.save

DELETE FROM `nurses` WHERE `nurses`.`nurseID` = 123
---
  def destroy
    @nurse.destroy

SELECT  `nurses`.* FROM `nurses` WHERE `nurses`.`nurseID` = 457 LIMIT 1
---
    def set_nurse
      @nurse = Nurse.find(params[:id])