project/app/controllers/patientinfos_controller.rb

  def index
    @patientinfos = Patientinfo.all
---
SELECT `patientinfos`.* FROM `patientinfos`

  def create
    @patientinfo = Patientinfo.new(patientinfo_params)

    respond_to do |format|
      if @patientinfo.save
---
INSERT INTO `patientinfos` (`name`, `birthDate`, `bloodType`, `dateCreated`, `dateUpdated`, `emergencyContact`) VALUES ('Dom Maravillo', '2018-12-03', 'O', '2018-12-03 11:14:00', '2018-12-03 11:14:00', 'dfadsf')

  def update
    respond_to do |format|
      if @patientinfo.update(patientinfo_params)
---
UPDATE `patientinfos` SET `name` = 'Nadz Danielle Reyes', `dateCreated` = '2018-12-03 18:26:00', `dateUpdated` = '2018-12-03 18:26:00' WHERE `patientinfos`.`patientID` = 123

  def destroy
    @patientinfo.destroy
---
DELETE FROM `patientinfos` WHERE `patientinfos`.`patientID` = 456

    def set_patientinfo
      @patientinfo = Patientinfo.find(params[:id])
---
SELECT  `patientinfos`.* FROM `patientinfos` WHERE `patientinfos`.`patientID` = 123 LIMIT 1