project/app/controllers/patienthistories_controller.rb

SELECT `patienthistories`.* FROM `patienthistories`
---
  def index
    @patienthistories = Patienthistory.all