project/app/controllers/patienttests_controller.rb

  def index
    @patienttests = Patienttest.all
---
SELECT `patienttests`.* FROM `patienttests`

    def set_patienttest
      @patienttest = Patienttest.find(params[:id])
---
SELECT  `patienttests`.* FROM `patienttests` WHERE `patienttests`.`patientTestID` = 2 LIMIT 1