project/app/controllers/runtests_controller.rb

SELECT `runtests`.* FROM `runtests`
---
  def index
    @runtests = Runtest.all