project/app/views/patienttests/_form.html.erb

SELECT  `patientinfos`.* FROM `patientinfos` WHERE `patientinfos`.`patientID` = 458 LIMIT 1
---
    <%#= form.number_field :patientID %>
    <%= form.select :patientID, options_for_select(Patientinfo.all.map{|s|[s.name, s.patientID]}) %>

SELECT `labtestsresults`.* FROM `labtestsresults`
---
    <%#= form.number_field :testID %>
    <%= form.select :testID, options_for_select(Labtestsresult.all.map{|s|[s.testName, s.testID]}) %>