project/app/views/patienttests/index.html.erb

SELECT  `patientinfos`.* FROM `patientinfos` WHERE `patientinfos`.`patientID` = 123 LIMIT 1
---
      <tr>
        <td class="selectable"><%= link_to Patientinfo.find(patienttest.patientID).name, patienttest%></td>

SELECT  `labtestsresults`.* FROM `labtestsresults` WHERE `labtestsresults`.`testID` = 10 LIMIT 1
---
        <td><%= patienttest.testID %></td>
        <td><%= Labtestsresult.find(patienttest.testID).testName %></td>